app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at", "post_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "test"], ["created_at", "2020-02-01 09:12:27.682387"], ["updated_at", "2020-02-01 09:12:27.682387"], ["post_id", 3], ["user_id", 2]]
UPDATE "comments" SET "updated_at" = $1, "time" = $2 WHERE "comments"."id" = $3  [["updated_at", "2020-02-01 09:12:27.687830"], ["time", "February 1st, 2020 01:12"], ["id", 5]]
---
    def create
      if user_signed_in?
        if (comment = current_user.comments.create(comment_params))
          comment.time = Time.now.to_formatted_s(:long_ordinal)
          comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 7]]
---
    def destroy
      if user_signed_in?
        comment = Comment.find(params[:id])
        if current_user.id == comment.user.id
          comment.destroy!