app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "image", "category", "platform", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "posts" SET "updated_at" = $1, "time" = $2 WHERE "posts"."id" = $3  [["updated_at", "2020-02-02 06:09:07.737489"], ["time", "February 1st, 2020 22:09"], ["id", 4]]
---
    def create
      if user_signed_in?
        if (post = current_user.posts.create(post_params))
          post.time = Time.now.to_formatted_s(:long_ordinal)
          post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def find_post_data
      post = Post.find(params[:id])