app/controllers/api/v1/user_controller.rb

    def update
      if user_signed_in?
        if current_user.update(user_params)
---
UPDATE "users" SET "name" = $1, "location" = $2, "bio" = $3, "avatar" = $4, "media" = $5, "company" = $6, "contact" = $7, "updated_at" = $8 WHERE "users"."id" = $9