app/controllers/api/v1/users_controller.rb

    def user_info
      user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def find_user_posts(user)
      @user_posts = []
      posts = user.posts.all
      posts.each do |p|
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]